In [218]:
# 준비하기
import pandas as pd

[문1] 아래 조건을 만족하는 Series를 생성하세요.
1) 데이터 : 1~50 범위에서 7의 배수 정수
2) 인덱스 : 'a~z' 범위에서 데이터 갯수 만큼의 알파벳
3) 타  입 : 부호가 없는 1바이트 정수
4) 이  름 : sevens
5) 속  성 : index, values, dtype, ndim, shape, size

In [219]:
seven = pd.Series([i for i in range(1,51) if i%7==0], dtype=(int))

In [236]:
seven.index = ['a', 'b', 'c', 'd', 'e', 'f', 'g']
seven

a     7
b    14
c    21
d    28
e    35
f    42
g    49
dtype: int32

In [243]:
seven.describe(include='all')

count     7.000000
mean     28.000000
std      15.121728
min       7.000000
25%      17.500000
50%      28.000000
75%      38.500000
max      49.000000
dtype: float64

[문2] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : knu_data.csv
2) 인덱스 : 컬럼 중 하나를 인덱스로 설정
3) 속성 정보 출력 
4) 데이터 확인 정보 출력
5) 타입과 실제 데이터 타입 일치

In [221]:
DF2 = pd.read_csv('../DATA/knu_data.csv', index_col=['mem_id'])
DF2

          team            time
mem_id
knu_21   경영지원팀  20231102200000
knu_03   대외협력팀  20231117200000
knu_01   대외협력팀  20231109200000
knu_09   경영지원팀  20221122200000
knu_01   경영지원팀  20221111200000

In [222]:
# 3.속성 정보 출력
DF2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, knu_21 to knu_01
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   team    5 non-null      object
 1   time    5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 120.0+ bytes

In [237]:
# 4. 데이터 확인 정보 출력?
DF2.describe

<bound method NDFrame.describe of mem_id
knu_21   1970-01-01 05:37:11.102200
knu_03   1970-01-01 05:37:11.117200
knu_01   1970-01-01 05:37:11.109200
knu_09   1970-01-01 05:37:01.122200
knu_01   1970-01-01 05:37:01.111200
Name: time, dtype: datetime64[ns]>

In [224]:
# 5. 타입과 셀제 데이터 타입 일치 여부
# 'time' 열은 날짜 단위이므로 datetime 으로 변환
DF2 = DF2.time.astype('datetime64[ns]')

[문3] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : stats_100701.xlsx
2) 년도별 인구가 가장 많은 지역과 가장 적은 지역 
3) 6대 광역시에서 년도별 인구가 가장 많은 지역과 가장 적은 지역 
4) 8도 중 7도에서 년도별 인구가 가장 많은 지역과 가장 적은 지역

In [225]:
DF3 = pd.read_excel('../DATA/stats_100701.xlsx', header=[1], index_col=[0]) # 이름 지정 및 인덱스와 제목열 수정
DF3

      2015   2016   2017   2018
계    51015  51218  51362  51607
서울    9941   9843   9766   9705
부산    3452   3447   3424   3400
대구    2469   2461   2458   2450
인천    2883   2907   2924   2939
광주    1506   1502   1495   1493
대전    1542   1536   1528   1518
울산    1164   1166   1159   1154
세종     187    234    266    304
경기   12423  12600  12786  13031
강원    1517   1521   1521   1521
충북    1589   1601   1609   1619
충남    2103   2126   2153   2180
전북    1835   1835   1829   1820
전남    1797   1798   1795   1790
경북    2678   2683   2675   2674
경남    3330   3338   3339   3356
제주     599    618    635    653
수도권  25247  25350  25476  25675

In [226]:
DF3_del = DF3.drop(index='계', axis='rows')  # 불필요한 합계 인덱스 제거

In [227]:
# 2. 연도별 인구가 가장 많은 지역과 적은 지역
for year in DF3.columns[1:]:
    DF3_sort = DF3_del.sort_values(by=year)
    print(f'{year}년 인구가 가장 많은 지역 : {DF3_sort.index[-1]}')
    print(f'{year}년 인구가 가장 적은 지역 : {DF3_sort.index[0]}')
    print()

2016년 인구가 가장 많은 지역 : 수도권
2016년 인구가 가장 적은 지역 : 세종

2017년 인구가 가장 많은 지역 : 수도권
2017년 인구가 가장 적은 지역 : 세종

2018년 인구가 가장 많은 지역 : 수도권
2018년 인구가 가장 적은 지역 : 세종

In [228]:
# 3. 6대 광역시 인구 비교
DF3_3 = DF3_sort.drop(
   labels=['세종', '경기', '강원', '충북', '충남', '전북', '전남', '경북', '경남', '제주', '수도권'], axis='index'
   )
for year in DF3.columns[1:]:
   DF3_sort = DF3_3.sort_values(by=year)
   print('6대 광역시 기준 :')
   print(f'{year}년 인구가 가장 많은 지역 : {DF3_3.index[-1]}')
   print(f'{year}년 인구가 가장 적은 지역 : {DF3_3.index[0]}')
   print()

6대 광역시 기준 :
2016년 인구가 가장 많은 지역 : 서울
2016년 인구가 가장 적은 지역 : 울산

6대 광역시 기준 :
2017년 인구가 가장 많은 지역 : 서울
2017년 인구가 가장 적은 지역 : 울산

6대 광역시 기준 :
2018년 인구가 가장 많은 지역 : 서울
2018년 인구가 가장 적은 지역 : 울산

In [229]:
DF3_del.index

Index(['서울', '부산', '대구', '인천', '광주', '대전', '울산', '세종', '경기', '강원', '충북', '충남',
       '전북', '전남', '경북', '경남', '제주', '수도권'],
      dtype='object')

In [230]:
# 3. 7도 인구 비교
DF3_4 = DF3_del.drop(
   labels=['서울', '부산', '대구', '인천', '광주', '대전', '울산', '세종', '강원', '제주', '수도권'], axis='index'
   )
for year in DF3.columns[1:]:
   DF3_sort = DF3_4.sort_values(by=year)
   print('7도 기준 :')
   print(f'{year}년 인구가 가장 많은 지역 : {DF3_4.index[-1]}')
   print(f'{year}년 인구가 가장 적은 지역 : {DF3_4.index[0]}')
   print()

7도 기준 :
2016년 인구가 가장 많은 지역 : 경남
2016년 인구가 가장 적은 지역 : 경기

7도 기준 :
2017년 인구가 가장 많은 지역 : 경남
2017년 인구가 가장 적은 지역 : 경기

7도 기준 :
2018년 인구가 가장 많은 지역 : 경남
2018년 인구가 가장 적은 지역 : 경기

[문4] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : stock price.xlsx
2) 데이터 로딩 시 인덱스로 사용할 수 있는 컬럼 설정
3) 결측치 처리 =>
   (가) 1개라도 NaN이면 모두 제거 / price가 NaN이면 제거 / value가 10000이하면 제거
   (나) 평균값으로 결측치 대체, 이전/이후 값으로 결측치 대체
4) value가 1000이하 이거나 price가 90000이상인 데이터

In [231]:
DF4 = pd.read_excel('../DATA/stock price.xlsx', index_col='id')
DF4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 13 entries, 128940 to 207940
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   stock_name  13 non-null     object
 1   value       11 non-null     float64
 2   price       11 non-null     float64
dtypes: float64(2), object(1)
memory usage: 416.0+ bytes

In [232]:
# 3. 결측치 처리

# (가 - 1) 1개라도 NaN이면 모두 제거
DF4.dropna()

       stock_name          value     price
id
128940       한미약품   59385.666667  421000.0
130960     CJ E&M   58540.666667   98900.0
138250      엔에스쇼핑   14558.666667   13200.0
139480        이마트  239230.833333  254500.0
142280     녹십자엠에스     468.833333   10200.0
145990        삼양사   82750.000000   82000.0
185750        종근당   40293.666667  100500.0
192400      쿠쿠홀딩스  179204.666667  177500.0
199800         툴젠   -2514.333333  115400.0
204210     모두투어리츠    3093.333333    3475.0

In [233]:
# (가 - 2) price가 NaN이면 제거
DF4.dropna(subset='price')

       stock_name          value     price
id
128940       한미약품   59385.666667  421000.0
130960     CJ E&M   58540.666667   98900.0
138250      엔에스쇼핑   14558.666667   13200.0
139480        이마트  239230.833333  254500.0
142280     녹십자엠에스     468.833333   10200.0
145990        삼양사   82750.000000   82000.0
185750        종근당   40293.666667  100500.0
192400      쿠쿠홀딩스  179204.666667  177500.0
199800         툴젠   -2514.333333  115400.0
204210     모두투어리츠    3093.333333    3475.0
207940   삼성바이오로직스            NaN   91900.0

In [241]:
# (가 - 3) value가 10000이하면 제거
DF4.dropna(thresh=10000, axis=['columns'])   #  : 미완

TypeError: supplying multiple axes to axis is no longer supported.

In [238]:
# (나) 평균값으로 결측치 대체, 이전/이후 값으로 결측치 대체

In [ ]:
# 4. value가 1000이하 이거나 price가 90000이상인 데이터
DF4[ (DF4.value <= 1000) | (DF4.price >= 90000) ]

       stock_name          value     price
id
128940       한미약품   59385.666667  421000.0
138040    메리츠금융지주     827.500000       NaN
130960     CJ E&M   58540.666667   98900.0
139480        이마트  239230.833333  254500.0
142280     녹십자엠에스     468.833333   10200.0
185750        종근당   40293.666667  100500.0
192400      쿠쿠홀딩스  179204.666667  177500.0
199800         툴젠   -2514.333333  115400.0
207940   삼성바이오로직스            NaN   91900.0